tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
	self->ischanged = 0;
	if(self->isinited && self->isstarted)
		if(FSP_SUCCESS == R_GLCDC_BufferChange(&g_display0_ctrl, fb_background[i? 1 : 0], DISPLAY_FRAME_LAYER_1))
		{
			self->ischanged = 1;
			self->idx = i;
		}
	return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_changebuf_obj, lcd_changebuf);
*/
// vsync([timeout_ms=20]) -- block until the NEXT GLCDC line-detect (VSYNC)
// event or timeout. Returns True if the pulse arrived, False on timeout.
// Used to gate LVGL render start so DIRECT-mode drawing chases the scanout
// beam instead of racing it mid-frame (visible flicker on frequent updates).
STATIC mp_obj_t lcd_vsync(size_t n_args, const mp_obj_t *args) {
    (void)args;
    uint32_t timeout_ms = (n_args > 1) ? (uint32_t)mp_obj_get_int(args[1]) : 20;
    uint32_t start_cnt = lcd_vsync_counter;
    uint32_t t0 = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == start_cnt) {
        if ((uint32_t)mp_hal_ticks_ms() - t0 >= timeout_ms) {
            return mp_const_false;
        }
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_vsync_obj, 1, 2, lcd_vsync);

/* ---- C LVGL display + input bridge -----------------------------------------------
 * Replaces the per-frame Python flush/touch/VSYNC callbacks in pRGB.py.  Those allocate
 * MicroPython wrapper objects on every render (flush) and every ~30 Hz input poll (read)
 * -- a continuous idle garbage stream that forces GC.  Registering the same three
 * callbacks in C removes that garbage entirely.  DIRECT single-framebuffer, identical
 * behaviour to the Python path (GLCDC framebuffer, cached FT5x06 touch, VSYNC gate). */
static void lcd_lv_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
    (void)area;
    (void)px_map;
    lv_display_flush_ready(disp);                    // DIRECT mode: drawing is done
}

static volatile uint32_t s_indev_calls = 0;          // diag: LVGL polls of the read cb
static volatile uint32_t s_indev_press = 0;          // diag: reads that saw a contact

static void lcd_lv_indev_read_cb(lv_indev_t *indev, lv_indev_data_t *data) {
    (void)indev;
    s_indev_calls++;
    /* The external IRQ only raises a flag. Service at most one bounded SCI-I2C read here,
     * in foreground context, then report the persistent DOWN/MOVE/HOLD versus UP level.
     * No fresh FT5x06 packet means "state unchanged", not a synthetic RELEASED. */
    (void)touch_service_pending();

    uint8_t active;
    int16_t x;
    int16_t y;
    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;
    active = s_lcd_touch_active;
    x = s_lcd_touch_x;
    y = s_lcd_touch_y;
    FSP_CRITICAL_SECTION_EXIT;
    if (active) {
        s_indev_press++;
    }
    data->point.x = (int32_t)x;
    data->point.y = (int32_t)y;
    data->state = active ? LV_INDEV_STATE_PRESSED : LV_INDEV_STATE_RELEASED;
}

// touch_debug() -> (indev polls, pressed polls, x, y, active, IRQs, I2C errors, timeouts).
STATIC mp_obj_t lcd_touch_debug(mp_obj_t self_in) {
    (void)self_in;
    mp_obj_t t[8] = {
        mp_obj_new_int_from_uint(s_indev_calls),
        mp_obj_new_int_from_uint(s_indev_press),
        MP_OBJ_NEW_SMALL_INT(s_lcd_touch_x),
        MP_OBJ_NEW_SMALL_INT(s_lcd_touch_y),
        MP_OBJ_NEW_SMALL_INT(s_lcd_touch_active),
        mp_obj_new_int_from_uint(s_touch_irq_count),
        mp_obj_new_int_from_uint(s_touch_i2c_errors),
        mp_obj_new_int_from_uint(s_touch_i2c_timeouts),
    };
    return mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_touch_debug_obj, lcd_touch_debug);

static void lcd_lv_render_start_cb(lv_event_t *e) {
    (void)e;
    uint32_t start_cnt = lcd_vsync_counter;          // wait for the next GLCDC frame pulse
    uint32_t t0 = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == start_cnt) {
        if ((uint32_t)mp_hal_ticks_ms() - t0 >= 20U) {
            break;
        }
    }
    s_lcd_render_start_frame = lcd_vsync_counter;
    s_lcd_render_start_us = (uint32_t)mp_hal_ticks_us();
}

static void lcd_lv_render_ready_cb(lv_event_t *e) {
    (void)e;
    if (s_lcd_render_start_us == 0U) {
        return;
    }
    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - s_lcd_render_start_us;
    s_lcd_render_last_us = elapsed;
    if (elapsed > s_lcd_render_max_us) {
        s_lcd_render_max_us = elapsed;
    }
    if (lcd_vsync_counter != s_lcd_render_start_frame) {
        s_lcd_render_crossed_frames++;
    }
}

/* ---- C spectrum surface ----------------------------------------------------------
 * A high-rate graph must not be represented by 27 independently laid-out Python
 * widgets.  This attaches one ordinary LVGL object to a native draw callback, stores
 * the 27 heights in fixed C memory, and invalidates only the changed bar strips.
 * There is no Python draw callback, flex re-layout, transient canvas, or heap traffic. */
static void lcd_lv_spectrum_bar_area(const lv_area_t *obj_area, uint32_t index,
    int32_t height, lv_area_t *bar_area) {
    int32_t width = lv_area_get_width(obj_area);
    int32_t gaps = (int32_t)(LCD_SPECTRUM_BARS - 1U) * LCD_SPECTRUM_GAP_PX;
    int32_t usable = width - gaps;
    int32_t base_w = usable / (int32_t)LCD_SPECTRUM_BARS;
    int32_t extra = usable % (int32_t)LCD_SPECTRUM_BARS;
    int32_t x = obj_area->x1 + (int32_t)index * (base_w + LCD_SPECTRUM_GAP_PX) +
        (((int32_t)index < extra) ? (int32_t)index : extra);
    int32_t bar_w = base_w + (((int32_t)index < extra) ? 1 : 0);
    if (height < 2) {
        height = 2;
    } else if (height > LCD_SPECTRUM_MAX_H_PX) {
        height = LCD_SPECTRUM_MAX_H_PX;
    }
    bar_area->x1 = x;
    bar_area->x2 = x + bar_w - 1;
    bar_area->y2 = obj_area->y2;
    bar_area->y1 = obj_area->y2 - height + 1;
}

/* Visual cadence is deliberately decoupled from the 10 Hz FFT producer.  Five
 * interleaved groups are committed on consecutive 20 ms ticks: each individual bar
 * still represents a 10 Hz stream, but only five or six bars change in one physical
 * display frame.  The groups are spread across the width (0,5,10... then 1,6,11...)
 * so the result reads as independent/parallel motion rather than a left-to-right wipe. */
static void lcd_lv_spectrum_timer_cb(lv_timer_t *timer) {
    (void)timer;
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !s_lcd_spectrum_target_valid) {
        return;
    }

